import os
os.system('color F0')      # 白色背景黑色文字
os.system('title 21点扑克游戏')  # 设置窗口标题

from random import *
from time import *
from datetime import datetime

'''工人A（发牌员），仅发牌，一人quantity张牌，只返回手牌。'''
def deal_initial_cards(cards, player, pc, quantity): 
    for i in range(quantity):
        a = choice(cards)   
        b = choice(cards)        
        player.append(a) # 列表的append方法
        pc.append(b)
    return player, pc  # return代表函数定义的结束，不再向下运行，为了后续计算和流程控制可以加上，方便调试。

'''工人B（点数计算员），分两步处理（先处理非A牌，再处理A牌）计算player或pc手中牌组的点数和，先只计数A，然后有一个A就加11或1。'''
def calculate_score(hand):  #给工人b一个参数hand，让函数知道自己计算的是哪幅手牌。
    total = 0 #设定初始总和为0
    ace_count = 0 #增加一个计数变量，用于统计手牌里有没有A，如果有就加一个
    for card in hand:
        if card == 'A': #如果手牌是A，则计数1，不求和
            ace_count += 1        
        elif card in ['J', 'Q', 'K']:#利用字典映射取值，如果card为JQK，则直接总和加10
            total += 10
        else:
            total += int(card)  #其他情况下加上card本身，
    #把A放进来判断是1还是11，计算点数和。
    for _ in range(ace_count): #用下划线表示不需要使用循环变量，玩家手中有几张A就执行几次循环计数
        if total + 11 > 21: #如果加总大于21点，则把A作为1，否则作为11
            total += 1
        else:
            total +=11
    return total #输出player手中当前牌组值之和

'''工人C（玩家互动员），询问玩家是否要牌，并返回玩家手牌。'''
def player_turn(player, cards):
    player_choice = input("是否继续要牌？继续请输入Y，放弃请输入N。").strip().lower()
    if player_choice == "y":
        player_addition = choice(cards)  #玩家获得第三张牌
        player.append(player_addition) #更新玩家手中三张牌组
    return player, player_choice #返回玩家手牌和玩家选择

'''工人D（点数计算员）：最新发牌后立即进行计数检查，判断玩家是否爆牌。可以直接用最新的player调用函数calculate_score()。'''
'''工人E（电脑逻辑员）：computer_turn(computer_hand) -> 玩家停牌后，根据固定规则（如<17点要牌）循环为电脑发牌。'''
def computer_turn(pc, cards):
    while calculate_score(pc) < 17: #计算手牌总和，用while实现求和循环，一直到超过17时停止接收手牌
            pc_addition = choice(cards)  #pc获得新牌
            pc.append(pc_addition) #更新pc手中牌组
    result = f"电脑明牌，电脑的手牌为{pc}"
    return result  

'''工作F 裁判员 首先检查玩家和电脑是否爆牌（超过21点），然后比较两者点数大小决定胜负，点数相同则判为平局。如前两张牌直接达到21点时，则宣布为"Blackjack"并给予奖励判定。'''
def judge_winner(player_hand, pc_hand):
#第1步：算分数
    ts_player = calculate_score(player_hand) #计算玩家手牌点数总和
    tc_player = len(player_hand) #计算列表长度，也即玩家手牌数量
    ts_pc = calculate_score(pc_hand) #计算pc手牌点数总和
    tc_pc = len(pc_hand) #计算列表长度，也即列表手牌数量
# 第2步：如果有人Blackjack → 按Blackjack规则判。
    player_bj =  ts_player == 21 and tc_player ==2 #玩家判定blackjack
    pc_bj = ts_pc == 21 and tc_pc ==2 #电脑判定blackjack
    if player_bj and pc_bj :
        result = "平局"
    elif player_bj :
        result = "玩家blackjack！\n(;◉∀◉)オッ(∀◉)◉ハッ(;∀)◉◉ヨｫー!!!\n哇哦，这是谁！这不是Aka·天选之子嘛！\n必须要再来一次了！"
        sleep(1.5)
    elif pc_bj:
        result = "电脑blackjack！没关系没关系，这是运气问题，再来一次吧！加油！( • ̀ω•́ )" 
        sleep(1.5)
# 第3步：如果有人爆牌 → 爆牌的人输  
    elif ts_player > 21 : #双方都爆牌时，通常判先爆的人输（玩家先爆）
        result =  "啊哦！可恶，怎么爆牌啦(〃＞皿＜) ！电脑赢，再来一次吧！╮(╯∀╰)╭！"
        sleep(1.5)
    elif ts_player <= 21 and ts_pc > 21:
        result = "电脑爆牌！意料之外吧？那必须再来一次！(*´∀`)~♥"
# 第4步：都没问题 → 比谁分数大
    elif ts_player > ts_pc:
        result = "恭喜恭喜！菜鸡获胜，撒花撒花，再来一次！(ゝ∀･)"
    elif ts_player < ts_pc:
        result = "啊哦，太遗憾啦，电脑赢了，没关系谁放弃谁是菜鸡~(@•́ ₃ •̀`@)"
    else:
        result =  "平局，太可惜啦，今天必须要一较高下！(｡ŏ_ŏ)"
#return result + "\n玩家的手牌是{},电脑的手牌是{}".format(player,pc)
    part_winner =  result
    part_scores =  f"玩家持有手牌的总点数是：{ts_player}点，电脑持有手牌的总点数是：{ts_pc}点。"
    part_cards =  f"玩家持有的手牌是：{player_hand}，电脑持有手牌是：{pc_hand}。"
    return part_winner, part_scores, part_cards #0是winner，1是score，2是cards
    #print("比赛结束。比赛结果为：{}".format(result))

'''补充一个时间函数，根据时间对玩家进行问候'''
def greeting():
    hour = datetime.now().hour
    minute = datetime.now().minute
    if hour < 9 :
        return "早上好！"
    elif hour < 12 :
        return "上午好！"
    elif hour < 14:
        return "中午好！"
    elif hour < 17:
        return "下午好！"
    else:
        return "晚上好！"

'''工作G调度员（主函数）：play_game() -> 组装，按顺序协调所有工人工作。'''
def play_game():
    cards = ["A", "2", "3", "4", "5", "6", "7", "8", "9", "10", "J", "Q", "K"] #设置牌堆
    player = []  #给玩家准备一个牌组
    pc = []  #给玩家准备一个牌组
    quantity = 2 #设置初始手牌数量
    result = "" #存储比赛结果
    # player = ["A","Q"] 调试用，玩家blackjack牌组
    # pc = [9,"Q"] 调试电脑明牌代码用
    print("="*100)
    hello = greeting() + "我的好兄弟！欢迎来到21点比赛现场！"
    hello_center = hello.center(80,"=") #将问候语居中
    print(hello_center)
    rule = input("你玩过21点吗？(Y/N): ".center(93,"=")).strip().lower() 
    print("="*100)
    if rule == 'n':
        print("没关系，我来带你熟悉一下游戏规则吧！♡(｡•ㅅ•｡)♡".center(79,"="))
        sleep(2)
        print("\n1.我们玩的是扑克版21点，开局每人发两张牌牌，你要努力让手牌点数之和靠近21点，但不可以超过哦～A可以视作1点或11点，J、Q、K都算10点！")
        sleep(4)
        print("2.你可以一直要新扑克牌，增加你手牌的总点数，在你停牌之后，电脑会自动补牌直到它满足17点以上啦～")
        sleep(4)
        print("3.我们的目标是：比比谁更大！分别计算你和电脑手牌的总点数，更接近21点的获胜！但是要小心哦，一旦超过21点就要爆牌啦！")
        sleep(4)        
        print("4.哦，对了。如果你开局两张牌直接21点，那就是超幸运的“Blackjack”！有小彩蛋哦！")
        sleep(4)             
    print("\n好哒！我想你应该准备好了，那我们现在就开始吧！\n赢了会有夸夸，输了也有鼓励哦～！一起奔着21点出发吧！好兄弟！↖(^ω^)↗\n")
    sleep(3)  # 暂停3秒，时间可调整
    print("="*100)  
    print("现在开始发牌，每位玩家各获得两张初始手牌🃏。")
    print("发牌中" + "."*95)
    sleep(2)  
    deal_initial_cards(cards, player, pc, quantity) #每人两张初始手牌
    print("玩家的手牌是{}".format(player)) #返回玩家手牌组
    sleep(3) 
    splayer = calculate_score(player)  #计算玩家手牌总点数 
    spc = calculate_score(pc) #计算电脑手牌总点数
    if splayer >=21 or spc >= 21: #一方大于21点，不发牌直接进行结果比较。
        print("="*100)      
        print("比赛结束！")
        print("结果判定中"+"."*90) #显示判定中，让玩家等待结果
        sleep(1.5)
        winner, scores, cards_info = judge_winner(player, pc) #用变量储存函数的调用结果，避免重复调用judge_winner）
        print(cards_info) #返回玩家和电脑的手牌组
        print(scores) #返回玩家和电脑持有的手牌总点数
        print("="*100)  
        print(winner) #比赛结束，返回比赛输赢结果
    else: #两方都小于21，则正常运行开始二轮发牌
        print("="*100)
        print("发牌完成，请玩家选择是否继续抽牌。")
        print("="*100)
        player, choice = player_turn(player,cards) #进行玩家抽牌回合，由玩家输出y或n
        while choice == "y" :  #玩家选择继续抽牌
            print("玩家的手牌是{}".format(player))
            sleep(3) 
            splayer = calculate_score(player) 
            if splayer >= 21:
                break #当点数≥21时跳出循环，直接爆牌，不再询问玩家更新手牌
            player, choice = player_turn(player,cards)
        if splayer >= 21 : #在玩家抽完后电脑抽牌前进行玩家分数判定，防止玩家达到21点。
            print("="*100)      
            print("比赛结束！")
            print("结果判定中"+"."*90) #显示判定中，让玩家等待结果       
            sleep(1.5)
            winner, scores, cards_info = judge_winner(player, pc) 
            print(cards_info) #返回玩家和电脑的手牌组
            print(scores) #返回玩家和电脑持有的手牌总点数
            print("="*100)  
            print(winner) #比赛结束，返回比赛输赢结果
        else: #玩家正常抽牌结束，没有人>=21点，此时电脑抽牌，进行比较。
            print("="*100)
            print("玩家回合结束，请电脑行动。")
            print("="*100)   
            sleep(1.5) 
            print(computer_turn(pc,cards)) #电脑进行回合进行抽牌，抽完之后电脑明牌
            sleep(1.5) 
            print("="*100)  
            print("比赛结束！")
            print("结果判定中"+"."*90) #显示判定中，让玩家等待结果
            sleep(1.5)
            winner, scores, cards_info = judge_winner(player, pc) 
            print(scores) #返回玩家和电脑持有的手牌总点数
            print("="*100)  
            print(winner) #比赛结束，返回比赛输赢结果
    player.clear() # 游戏结束时在函数内部清空手牌
    pc.clear()
            
'''需要运行封装好的主函数main()，增加一个再玩一次的选项'''
if __name__ == "__main__": # 给py文件增加一个使用开关，import时不会自动运行
    game_result = play_game()
    play_again = input("\n是否再玩一次？(Y/N): ").strip().lower() # 询问是否再玩一次
    while play_again == 'y':
        print("\n" + "="*100)
        sleep(3) 
        play_game()
        play_again = input("\n是否再玩一次？(Y/N): ").strip().lower() #可以无限次数游戏
    print("游戏结束，我们下次再见！")
    sleep(1) 
    
input("游戏结束，请按回车键关闭窗口...")  # 等待用户回车确认

